In [2]:
import pandas as pd

In [3]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [3]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

#### 11.1 How to remove a column  (for example - continent) ?

In [6]:
drinks.drop('continent',axis = 1).head(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

Continent column is dropped , as (inplace = True ) is not used this doesnt change the underlying data. Here axis = 1 states that mentioned string is a column name. Below is an example of dropping rows

#### 11.2 How to remove a row  ?

In [7]:
drinks.drop(0,axis = 0).head(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
5,Antigua & Barbuda,102,128,45,4.9,North America

row 0 i.e Afghanistan is dropped.

###### axis = 1 to use while dropping column 
###### axis = 0 to use while dropping row

#### 11.3 Using axis with mathematical operator ?

In [8]:
drinks.mean()

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

Here pandas is providing  mean by considering rows for a particular column i.e by default its using axis=0 what if user tries to get mean for all the columns at particular row. For example if i want to look at mean for Albania for (beer_servings	spirit_servings	wine_servings	total_litres_of_pure_alcohol)

In [10]:
drinks.mean(axis=1).head()

0      0.000
1     69.975
2      9.925
3    176.850
4     81.225
dtype: float64

Above we can see now we have column level mean i.e left to right comining all column.

In [4]:
drinks.mean(axis=1).shape

(193,)

In [5]:
drinks.mean(axis=0).shape

(4,)

Above two blocks explain how axes is working in both the scenario.

#### 11. axis names

In [7]:
drinks.mean(axis='columns').head()

0      0.000
1     69.975
2      9.925
3    176.850
4     81.225
dtype: float64

In [8]:
drinks.mean(axis='index')

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

Both Insex and column are similar to 1 and 0 where 1 is used when we look at column based view and 0 row based view.